package pm._if.operator;

public class Demo08 {
    public static void main(String[] args) {
        // 隐式转换的底层逻辑
        byte a = 10; // 1 个字节，8 个 bit 即 原码 -> 0000 1010
        int b = 10; // 4 个字节 原码 -> 0000 0000 0000 0000 0000 0000 0000 1010
        // 先要把 a 转成 int 类型 即 原码 -> 0000 0000 0000 0000 0000 0000 0000 1010
        /*
         *   0000 0000 0000 0000 0000 0000 0000 1010
         * + 0000 0000 0000 0000 0000 0000 0000 1010
         *   0000 0000 0000 0000 0000 0000 0001 0100  -> 20
         */
        System.out.println(a + b); // 20

        // 强制转换
        int num = 200; // 原码 -> 0000 0000 0000 0000 0000 0000 1100 1000
        // 计算机中计算都是以补码的方式计算的
        byte num1 = (byte)num; // 原码 -> 1100 1000 反码 -> 1011 0111 补码 -> 1011 1000
        System.out.println(num1); // -56
    }
}
